# -*- coding: utf-8 -*-

"""
Задание 23.1

В этом задании необходимо создать класс IPAddress.

При создании экземпляра класса, как аргумент передается IP-адрес и маска,
а также должна выполняться проверка корректности адреса и маски:
* Адрес считается корректно заданным, если он:
   - состоит из 4 чисел разделенных точкой
   - каждое число в диапазоне от 0 до 255
* маска считается корректной, если это число в диапазоне от 8 до 32 включительно

Если маска или адрес не прошли проверку, необходимо сгенерировать
исключение ValueError с соответствующим текстом (вывод ниже).

Также, при создании класса, должны быть созданы два атрибута экземпляра:
ip и mask, в которых содержатся адрес и маска, соответственно.

Пример создания экземпляра класса:
In [1]: ip = IPAddress('10.1.1.1/24')

Атрибуты ip и mask
In [2]: ip1 = IPAddress('10.1.1.1/24')

In [3]: ip1.ip
Out[3]: '10.1.1.1'

In [4]: ip1.mask
Out[4]: 24

Проверка корректности адреса (traceback сокращен)
In [5]: ip1 = IPAddress('10.1.1/24')
---------------------------------------------------------------------------
...
ValueError: Incorrect IPv4 address

Проверка корректности маски (traceback сокращен)
In [6]: ip1 = IPAddress('10.1.1.1/240')
---------------------------------------------------------------------------
...
ValueError: Incorrect mask

"""
from pprint import pprint
import ipaddress
import re

class IPAddress:
    def __init__(self,network):
        self.network = network
        ip = self.network.split('/')[0]
        mask = int(self.network.split('/')[1])
        match_ip = re.search(r'\d+\.\d+\.\d+\.\d+', ip)
        if match_ip and ipaddress.IPv4Address(ip):
            pass
        else:
            raise ValueError(f"Incorrect IPv4 address")
        if not mask in range(8,33):
            raise ValueError(f"Incorrect mask")
        self.ip = ip
        self.mask = mask

if __name__ == "__main__":
    netw = IPAddress('172.16.1.2/32')
    print(netw.ip)